{
    "id": "whats-new-v2#p140762392",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "3WzwoDuFbY7GSZczsMMAW1",
    "dateCreated": "2024-07-25 18:23:25+00:00",
    "dateUpdated": "2024-08-07 17:15:57+00:00",
    "postBody": "Today, we announce AWS End User Messaging as the new name for Amazon Pinpoint’s SMS, MMS, push, and text to voice messaging capabilities. We are making this change to simplify how you manage end user communications across your applications and other AWS services. AWS End User Messaging provides developers with a scalable and cost-effective messaging infrastructure without compromising the safety, security, or results of their communications. Developers can integrate messaging to support uses cases such as one-time passcodes (OTP) at sign-ups, account updates, appointment reminders, delivery notifications, promotions and more.\nYour existing applications will continue to work as they did previously and you do not need to take any actions. We have updated the new name for SMS, MMS, push, and text to voice messaging in the AWS Management console, documentation, AWS support, and service webpages. There are no changes to APIs, the AWS Command Line Interface (AWS CLI), the AWS Identity and Access Management (IAM) access policies, service events, and endpoints. The marketing features of campaigns, journeys, segmentation, and analytics continue to be available as Amazon Pinpoint.\nTo learn more and get started, see here.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/aws-end-user-messaging",
    "postDateTime": "2024-07-29 13:00:00-04:00",
    "postDate": "2024-07-29",
    "contentType": "Launch Announcement",
    "headline": "Introducing AWS End User Messaging",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-pinpoint",
            "name": "amazon-pinpoint",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-pinpoint"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#business-productivity",
            "name": "business-productivity",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/business-productivity"
        }
    ]
}