{
    "id": "whats-new-v2#launchmarketingintake1034",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "2MRvJ2DQ51YBhCBuQ3j2d9",
    "dateCreated": "2024-08-07 18:26:16+00:00",
    "dateUpdated": "2024-08-28 18:29:12+00:00",
    "postBody": "Today, AWS announces AWS Parallel Computing Service (AWS PCS), a new managed service that lets you run and scale high performance computing (HPC) workloads on AWS. The service enables you to build scientific and engineering models, and run simulations using your preferred HPC job scheduler (starting with Slurm). AWS PCS allows you to build complete HPC clusters that integrates compute, storage, networking, and visualization resources, and seamlessly scale from zero to thousands of instances. The service offers a fully managed Slurm scheduler with built-in technical support and a rich set of customization options, helping you tailor your HPC environment to your specific needs and integrate it with your preferred software stack.\nWith AWS PCS, you can take advantage of the scalability and flexibility of AWS for your HPC workloads, while maintaining compatibility with existing applications and job scripts. It simplifies cluster management by offering a unified set of APIs, AWS Management Console, SDK, and CLI tools for cluster provisioning and infrastructure updates. This helps you to reduce operational overhead, so you can focus more on your core engineering and scientific research, and less on compute infrastructure management.\nAWS PCS is available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (Ireland), and Europe (Stockholm).\nTo learn more, visit AWS Parallel Computing Service and read the blog post.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/aws-parallel-computing-service",
    "postDateTime": "2024-08-28 14:30:00-04:00",
    "postDate": "2024-08-28",
    "contentType": "Launch Announcement",
    "headline": "Announcing AWS Parallel Computing Service",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#compute",
            "name": "compute",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/compute"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#aws-parallel-computing-service",
            "name": "aws-parallel-computing-service",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "<p>aws-parallel-computing-service</p>\n"
        }
    ]
}