{
    "id": "whats-new-v2#p136934792",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-pHH82CHRfeYEiZsqsug3Hx",
    "dateCreated": "2024-07-30 16:06:42+00:00",
    "dateUpdated": "2024-08-05 20:38:21+00:00",
    "postBody": "AWS CodeBuild now supports building and testing your software applications on three new Arm-based compute types: Medium, X-Large and 2X-Large. You can select up to 48 vCPUs and 96 GB memory to run more resource-intensive workloads.\nWith the addition of these new compute types, you now have similar compute options for running x86 and Arm workloads on CodeBuild. You can build and test your software applications on Arm without the need to emulate or cross-compile. CodeBuild supports AWS Graviton 3 processors, which delivers a leap in performance and capabilities over previous generations of AWS Graviton processors.\nThese compute types are now available in: US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), China (Beijing), China (Ningxia), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Milan), Europe (Paris), Europe (Spain), Europe (Stockholm), Israel (Tel Aviv), Middle East (Bahrain), Middle East (UAE), South America (São Paulo).\nTo learn more about CodeBuild’s compute options, please visit our documentation. To get started, visit the AWS CodeBuild product page.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/aws-codebuild-three-arm-based-compute-types/",
    "postDateTime": "2024-08-05 10:00:00-07:00",
    "postDate": "2024-08-05",
    "contentType": null,
    "headline": "AWS CodeBuild now supports three new Arm-based compute types",
    "tags": [
        {
            "id": "whats-new-v2#general-products#aws-codebuild",
            "name": "aws-codebuild",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-codebuild"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#developer-tools",
            "name": "developer-tools",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/developer-tools"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}