{
    "id": "whats-new-v2#p152741188",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "xq9DuFQgEyg8gNM3pRMjK4",
    "dateCreated": "2024-09-05 22:13:24+00:00",
    "dateUpdated": "2024-09-06 17:00:21+00:00",
    "postBody": "Amazon RDS for PostgreSQL 17 Release Candidate 1 (RC1) is now available in the Amazon RDS Database Preview Environment, allowing you to evaluate the pre-release of PostgreSQL 17 on Amazon RDS for PostgreSQL. You can deploy PostgreSQL 17 RC1 in the Amazon RDS Database Preview Environment that has the benefits of a fully managed database.\nPostgreSQL 17 includes updates to vacuuming that reduces memory usage, improves time to finish vacuuming, and shows progress of vacuuming indexes. With PostgreSQL 17, you no longer need to drop logical replication slots when performing a major version upgrade. PostgreSQL 17 continues to build on the SQL/JSON standard, adding support for `JSON_TABLE` features that can convert JSON to a standard PostgreSQL table. The `MERGE` command now supports the `RETURNING` clause, letting you further work with modified rows. PostgreSQL 17 also includes general improvements to query performance and adds more flexibility to partition management with the ability to SPLIT/MERGE partitions. Please refer to the PostgreSQL community announcement for more details.\nAmazon RDS Database Preview Environment database instances are retained for a maximum period of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots that are created in the preview environment can only be used to create or restore database instances within the Preview Environment. You can use the PostgreSQL dump and load functionality to import or export your databases from the Preview Environment.\nAmazon RDS Database Preview Environment database instances are priced as per the pricing in the US East (Ohio) Region.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/postgresql-17-rc1-amazon-rds-database-preview-environment",
    "postDateTime": "2024-09-06 13:00:00-04:00",
    "postDate": "2024-09-06",
    "contentType": "launch announcement",
    "headline": "PostgreSQL 17 RC1 is now available in Amazon RDS Database preview environment",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        },
        {
            "id": "whats-new-v2#general-products#amazon-rds",
            "name": "amazon-rds",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-rds"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}