{
    "id": "whats-new-v2#p151100328",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "7RoNJCZBb2KDzgeknmVNmW",
    "dateCreated": "2024-09-05 20:42:08+00:00",
    "dateUpdated": "2024-09-05 20:51:45+00:00",
    "postBody": "You can now automatically mark a performance evaluation question as not applicable based on conversational insights (e.g., detected call reason, etc.), and you can now use additional contact metrics (e.g., longest hold duration, number of holds, agent interaction duration including holds) to automatically fill answers to questions in the evaluation form. With this launch, you can automatically complete only the applicable evaluation questions, under specific conditions. For example, you could check if an agent explained new account benefits and pricing, only for those customers who called to open an account. Additionally, you can automatically evaluate whether the agent was able to resolve the customer’s issue efficiently (e.g., resolved the customer’s issue within 10 minutes) and did not put the customer repeatedly on hold.\nThis feature is available in all regions where Contact Lens performance evaluations is already available. To learn more, please visit our documentation and our webpage. For information about Contact Lens pricing, please visit our pricing page.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-connect-contact-lens-automate-agent-performance-evaluations",
    "postDateTime": "2024-09-05 16:50:00-04:00",
    "postDate": "2024-09-05",
    "contentType": "launch announcement",
    "headline": "Amazon Connect Contact Lens now supports new ways to automate agent performance evaluations",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#business-productivity",
            "name": "business-productivity",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/business-productivity"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-connect",
            "name": "amazon-connect",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-connect"
        }
    ]
}