{
    "id": "whats-new-v2#p137787061",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "pbPfzwsfo5doA7jqwvodpb",
    "dateCreated": "2024-07-22 16:03:22+00:00",
    "dateUpdated": "2024-09-05 18:33:39+00:00",
    "postBody": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R7i instances are available in Europe (Milan).\nAmazon EC2 R7i instances are powered by custom 4th Generation Intel Xeon Scalable processors (code-named Sapphire Rapids), available only on AWS, offer up to 15% better performance over comparable x86-based Intel processors utilized by other cloud providers.\nR7i instances deliver up to 15% better price-performance versus R6i instances. These instances are SAP certified and are a great choice for memory-intensive workloads, such as SAP, SQL and NoSQL databases, distributed web scale in-memory caches, in-memory databases like SAP HANA, and real time big data analytics like Hadoop and Spark. They offer larger instance sizes, up to 48xlarge, and two bare metal sizes (metal-24xl, metal-48xl) for high-transaction and latency-sensitive workloads. These bare-metal sizes support built-in Intel accelerators: Data Streaming Accelerator, In-Memory Analytics Accelerator, and QuickAssist Technology, allowing customers to facilitate efficient offload and acceleration of data operations and optimize performance for workloads.\nR7i instances support the new Intel Advanced Matrix Extensions (AMX) that accelerate matrix multiplication operations for applications such as CPU-based ML. In addition, customers can now attach up to 128 EBS volumes to an R7i instance (vs 28 EBS volume attachments on R6i). This allows processing of larger amounts of data, scale workloads, and improve performance over R6i instances.\nTo learn more, visit Amazon EC2 R7i Instances.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-ec2-r7i-instances-additional-aws-region",
    "postDateTime": "2024-09-05 14:30:00-04:00",
    "postDate": "2024-09-05",
    "contentType": "Launch Announcement",
    "headline": "Amazon EC2 R7i instances are now available in additional AWS region",
    "tags": [
        {
            "id": "whats-new-v2#general-products#amazon-ec2",
            "name": "amazon-ec2",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-ec2"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#compute",
            "name": "compute",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/compute"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}