{
    "id": "whats-new-v2#p143047594",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "gDrbb2oNrosFS3R6JoyNXC",
    "dateCreated": "2024-08-06 19:23:49+00:00",
    "dateUpdated": "2024-08-08 21:40:14+00:00",
    "postBody": "Amazon Cognito enhances Advanced Security Features (ASF) to detect additional risk factors and cover custom authentication flows. ASF now identifies risks such as impossible travel, where a user signs in from two different locations in a time period implausible for travel between them. Additionally, ASF now detects risks in custom authentication flows. Customers can improve the security of applications that use custom authentication factors by enabling risk detection and adaptive authentication.\nAmazon Cognito simplifies the process of adding authentication, authorization, and user management to your web and mobile apps. The service provides authentication for applications with millions of users and supports sign-in with social identity providers such as Apple, Facebook, Google, and Amazon, and enterprise identity providers via standards such as SAML 2.0 and OpenID Connect.\nThis new feature is now available as part of Cognito advanced security features in all AWS Regions, except AWS GovCloud (US) Regions.\nTo get started, see the following resources:\nAmazon Cognito threat protection using Advanced Security Features (ASF)\nAmazon Cognito advanced security features pricing\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/amazon-cognito-asf-additional-risks-cover-custom-authentication-flows",
    "postDateTime": "2024-08-08 17:40:00-04:00",
    "postDate": "2024-08-08",
    "contentType": "Launch Announcement",
    "headline": "Amazon Cognito enhances Advanced Security Features (ASF) to detect additional risks and to cover custom authentication flows ",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-cognito",
            "name": "amazon-cognito",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-cognito"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#security-identity-and-compliance",
            "name": "security-identity-and-compliance",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/security-identity-and-compliance"
        }
    ]
}