{
    "id": "whats-new-v2#launchmarketingintake1123",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "8CZ272j37Tx6DXAMwnV84u",
    "dateCreated": "2024-07-02 15:46:31+00:00",
    "dateUpdated": "2024-07-10 15:27:03+00:00",
    "postBody": "Amazon SageMaker, a fully managed machine learning service, announces the general availability of Amazon Q Developer in SageMaker Studio. SageMaker Studio customers now get generative AI assistance powered by Q Developer right within their JupyterLab Integrated Development Environment (IDE). With Q Developer, data scientists and ML engineers can access expert guidance on SageMaker features, code generation, and troubleshooting. This allows for more productivity by eliminating the need for tedious online searches and documentation review, and ensuring more time delivering differentiated business value.\nData scientists and ML engineers using JupyterLab in SageMaker Studio can kick off their model development lifecycle with Amazon Q Developer. They can use the chat capability to discover and learn how to leverage SageMaker features for their use case without having to sift through extensive documentation. As well, users can generate code tailored to their needs and jump-start the development process. Further, they can use Q Developer to get in-line code suggestions and conversational assistance to edit, explain, and document their code in JupyterLab. Users can also leverage Q Developer to receive step by step guidance for troubleshooting when running into errors. With the introduction of Q Developer, users can leverage generative AI assistance within their JupyterLab environment. This integration empowers data scientists and ML engineers to accelerate their workflow, enhance productivity, and deliver ML models more efficiently, streamlining the machine learning development process.\nThis feature is available in all commercial AWS regions where SageMaker Studio is available.\nFor additional details, see our product page and documentation.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/amazon-q-developer-sagemaker-studio",
    "postDateTime": "2024-07-10 13:00:00-04:00",
    "postDate": "2024-07-10",
    "contentType": "Launch Announcement",
    "headline": "Amazon Q Developer is now available in SageMaker Studio",
    "tags": [
        {
            "id": "whats-new-v2#general-products#amazon-sagemaker-studio",
            "name": "amazon-sagemaker-studio",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-sagemaker-studio"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#artificial-intelligence",
            "name": "artificial-intelligence",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/artificial-intelligence"
        }
    ]
}