{
    "id": "whats-new-v2#p144886336",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "hzPyAGYwJ8Q87qdk2qDekA",
    "dateCreated": "2024-08-13 21:52:19+00:00",
    "dateUpdated": "2024-08-20 16:59:13+00:00",
    "postBody": "AWS Lambda now supports function-level configuration which allows you to disable or enable recursive loop detection. Lambda recursive loop detection, which is enabled by default, is a preventative guardrail that automatically detects and stops recursive invocations between Lambda and other supported services, preventing runaway workloads.\nBefore, customers running intentionally recursive patterns could only turn off recursive loop detection on a per-account basis through AWS Support. Now customers can disable or enable recursive loop detection on a per-function basis, allowing them to run their intentionally recursive workflows while protecting the remaining functions in their account from runaway workloads caused by unintended recursive invocations.\nThese new API actions are available in all AWS Regions where recursive loop detection is supported. You can set your function’s recursion configuration programmatically, as a parameter in your CloudFormation template, or within the AWS Lambda Console.\nTo learn more about Lambda’s new recursive loop detection API actions, please refer to Lambda’s API reference or the launch blog post.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/aws-lambda-supports-function-level-configuration-recursive-loop-detection",
    "postDateTime": "2024-08-20 13:00:00-04:00",
    "postDate": "2024-08-20",
    "contentType": "Launch Announcement",
    "headline": "AWS Lambda now supports function-level configuration for recursive loop detection",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#compute",
            "name": "compute",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/compute"
        },
        {
            "id": "whats-new-v2#general-products#aws-lambda",
            "name": "aws-lambda",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-lambda"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}