{
    "id": "whats-new-v2#p148094908",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "mhVi3nPZB1XXdfUwgX7Man",
    "dateCreated": "2024-08-26 16:30:06+00:00",
    "dateUpdated": "2024-09-13 17:39:47+00:00",
    "postBody": "Amazon Neptune Database is now available in the AWS Europe (Spain) Region on engine versions 1.3.3.0 and later. You can now create Neptune clusters using Serverless, R5, R5d, R6g, R6i, X2iedn, T3, and T4 instance types in the AWS Europe (Spain) Region.\nAmazon Neptune Database is a fast, reliable, and fully managed graph database as a service that makes it easy to build and run applications work with highly connected datasets. You can build applications using Apache TinkerPop Gremlin or openCypher on the Property Graph model, or using the SPARQL query language on W3C Resource Description Framework (RDF). Neptune also offers enterprise features such as high availability, automated backups, and network isolation to help customers quickly deploy applications to production.\nTo get started, you can create a new Neptune cluster using the AWS Management Console, AWS CLI, or a quickstart AWS CloudFormation template. For more information on pricing and region availability, refer to the Neptune pricing page and AWS Region Table.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-neptune-database-aws-europe-spain-region",
    "postDateTime": "2024-09-13 13:00:00-04:00",
    "postDate": "2024-09-13",
    "contentType": null,
    "headline": "Amazon Neptune Database is now available in AWS Europe (Spain) Region",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-neptune",
            "name": "amazon-neptune",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-neptune"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        }
    ]
}