{
    "id": "whats-new-v2#v1460388635",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-5hE6XB9MF2JjBtgHLcdpcD",
    "dateCreated": "2024-09-03 16:28:27+00:00",
    "dateUpdated": "2024-09-04 20:12:58+00:00",
    "postBody": "We are excited to announce the launch of enhanced management options for Amazon Timestream for InfluxDB, allowing you to scale your instance sizes up or down as needed and update your deployment configuration between Single-AZ and Multi-AZ, giving you greater flexibility and control over your time-series data processing and analysis.\nTimestream for InfluxDB is extensively used in applications that require high-performance time-series data processing and analysis. You can quickly respond to changes in data ingestion rates, query volumes, or other workload fluctuations by scaling your instances sizes up and down, ensuring that your Timestream for InfluxDB instances always have the necessary resources to handle your workload and cost effectively. You can also change your availability configuration by moving between Single-AZ and Multi-AZ configurations depending on your needs and budget. This means you can focus on building and deploying your applications, rather than worrying about instance sizing and management.\nAmazon Timestream for InfluxDB is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), Asia Pacific (Sydney), Asia Pacific (Singapore), Asia Pacific (Mumbai), Europe (Ireland), Europe (Frankfurt), and Europe (Stockholm).\nYou can create a Amazon Timestream Instance from the Amazon Timestream console, AWS Command line Interface (CLI), or SDK, and AWS CloudFormation. To learn more about compute scaling for Amazon Timestream for InfluxDB, visit the product page, documentation, and pricing page.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-timestream-influxdb-enhanced-managed-features/",
    "postDateTime": "2024-09-04 10:00:00-07:00",
    "postDate": "2024-09-04",
    "contentType": null,
    "headline": "Amazon Timestream for InfluxDB now supports enhanced management features",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-timestream",
            "name": "amazon-timestream",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-timestream"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        }
    ]
}