{
    "id": "whats-new-v2#p128928679",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "8fzQLzeuG6n2jPWPcMu6H7",
    "dateCreated": "2024-07-08 19:46:36+00:00",
    "dateUpdated": "2024-07-23 16:59:58+00:00",
    "postBody": "We are excited to announce public availability of Mainframe Modernization Code Conversion with mLogica. This new capability enables automated conversion of legacy code written in Assembler language to COBOL. The majority of mainframe environments include Assembler code that is expensive to maintain. Modernization of the code unblocks modernization projects to enable refactor projects, replatform projects, on-mainframe modernization initiatives, within AWS Mainframe Modernization toolchains, or to use alongside third-party modernization toolchains.\nAWS Mainframe Modernization service allows you to modernize and migrate on-premises mainframe applications to AWS. It offers automated refactor and replatform patterns, as well as augmentation patterns via data replication and file transfer.\nAWS Mainframe Modernization Code Conversion is available through the AWS Mainframe Modernization service console. To learn more, visit AWS Mainframe Modernization service product and documentation pages.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/aws-mainframe-modernization-code-conversion-mlogica-generally-available",
    "postDateTime": "2024-07-23 13:00:00-04:00",
    "postDate": "2024-07-23",
    "contentType": "Launch Announcement",
    "headline": "AWS Mainframe Modernization Code Conversion with mLogica is now generally available",
    "tags": [
        {
            "id": "whats-new-v2#general-products#aws-mainframe-modernization",
            "name": "aws-mainframe-modernization",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-mainframe-modernization"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#migration",
            "name": "migration",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/migration"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}