{
    "id": "whats-new-v2#d141147157",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-5ybRN3h6dF1TyyGXUrSLj7",
    "dateCreated": "2024-07-01 16:02:17+00:00",
    "dateUpdated": "2024-07-12 02:57:04+00:00",
    "postBody": "AWS Managed Services (AMS) Accelerate customers can now use Trusted Remediator to automatically remediate recommendations based on Trusted Advisor checks. By eliminating human effort required to fix misconfigurations on the accounts, Trusted Remediator improves security, fault tolerance, performance, while simultaneously reducing cost for AMS customers. AMS helps you operate AWS efficiently and securely. It extends your operations team’s capabilities with operational and security monitoring, incident detection and management, patch, backup, and cost optimization.\nTrusted Remediator uses tested and proven automation solutions to not only minimize security risks but also scales operations processes by consistently providing quality remediations. Examples of supported checks include underutilized Amazon EBS Volumes and Amazon Redshift should have automatic upgrades to major versions enabled. Trusted Remediator provides customers with the flexibility to configure remediations across single or multiple accounts. Customers can choose to remediate checks at the account level or resource level, with the ability to apply tag-based exceptions.\nTo learn more, see Trusted Remediator. Learn more about AMS here.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/aws-managed-services-accelerate-trusted-remediator/",
    "postDateTime": "2024-07-02 10:00:00-07:00",
    "postDate": "2024-07-02",
    "contentType": null,
    "headline": "AWS Managed Services (AMS) Accelerate now includes Trusted Remediator",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#management-and-governance",
            "name": "management-and-governance",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/management-and-governance"
        },
        {
            "id": "whats-new-v2#general-products#aws-managed-services",
            "name": "aws-managed-services",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-managed-services"
        }
    ]
}