{
    "id": "whats-new-v2#p144948506",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "gSHYPLHf5ePgRZjSJPgp5C",
    "dateCreated": "2024-09-04 19:50:11+00:00",
    "dateUpdated": "2024-09-09 20:36:46+00:00",
    "postBody": "AWS Graviton3-based R7g database instances are now generally available for Amazon Aurora with PostgreSQL compatibility and Amazon Aurora with MySQL compatibility in 15 additional regions, including US West (N. California), Canada (Central), South America (Sao Paulo), Europe (Stockholm), Europe (Frankfurt), Europe (London), Europe (Milan), Europe (Spain), Asia Pacific (Mumbai), Asia Pacific (Hyderabad), Asia Pacific (Seoul), Asia Pacific (Tokyo), Asia Pacific (Singapore), Asia Pacific (Sydney), and Asia Pacific (Hong Kong). AWS Graviton3 instances provide up to 30% performance improvement and up to 20% price/performance improvement over Graviton2 instances for Amazon Aurora, depending on the database engine version and workload.\nAWS Graviton3 processors are custom-designed AWS Graviton processors built on the AWS Nitro System. The Graviton3 processors offer several improvements over the second-generation Graviton processors. R7g database instances offer up to 30Gbps enhanced networking bandwidth and up to 20 Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS).\nYou can spin up Graviton3 R7g database instances in the Amazon RDS Management Console or using the AWS CLI. Upgrading a database instance to Graviton3 requires a simple instance type modification. For more details, refer to the Aurora documentation.\nAmazon Aurora is designed for unparalleled high performance and availability at global scale with full MySQL and PostgreSQL compatibility. It provides built-in security, continuous backups, serverless compute, up to 15 read replicas, automated multi-Region replication, and integrations with other AWS services. To get started with Amazon Aurora, take a look at our getting started page.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-aurora-r7g-graviton3-based-instance-family-additional-regions",
    "postDateTime": "2024-09-09 16:35:00-04:00",
    "postDate": "2024-09-09",
    "contentType": "launch announcement",
    "headline": "Amazon Aurora now supports R7g Graviton3-based instance family in 15 additional regions",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        },
        {
            "id": "whats-new-v2#general-products#amazon-aurora",
            "name": "amazon-aurora",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-aurora"
        }
    ]
}