{
    "id": "whats-new-v2#d158475630",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-bjLcePXUK6hV5ojMwNUEQD",
    "dateCreated": "2024-09-06 15:33:02+00:00",
    "dateUpdated": "2024-09-09 20:10:59+00:00",
    "postBody": "Today, we’re announcing the general availability of expanded industrial protocol support for AWS IoT SiteWise. Through a new integration with AWS Partner Litmus, customers can now ingest data from 100+ additional industrial protocols including proprietary protocols from companies like Allen-Bradley, Beckhoff, Emerson, Fanuc, Mitsubishi, Omron, and Yaskawa along with many others. Previously, ingesting data from these protocols required acquiring, provisioning, and configuring infrastructure and middleware for data collection resulting in additional cost and time to value.\nThrough a simple drop-down selection in the AWS Console, users add AWS Partner Litmus Edge software as a data source on their AWS IoT SiteWise Edge gateway. Users then configure the protocols, build data flows, and configure data processing in the partner application. After configurations are deployed, the equipment data flows to AWS IoT SiteWise Edge for local monitoring, storage, and access. It is also sent to AWS IoT SiteWise for integration with other industrial data and usage in other AWS Cloud services.\nAWS IoT SiteWise is a managed service that makes it easy to collect, store, organize and monitor data from industrial equipment at scale. AWS IoT SiteWise Edge extends the cloud capabilities to on-premises applications.\nThis new feature is generally available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Ireland), Europe (Frankfurt), Asia Pacific (Mumbai), Asia Pacific (Tokyo), Asia Pacific (Singapore), Asia Pacific (Seoul), Asia Pacific (Sydney) and Canada (Central).\nTo learn more, visit the AWS IoT SiteWise user guide.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/aws-iot-sitewise-edge-100-protocols-litmus-edge/",
    "postDateTime": "2024-09-09 10:00:00-07:00",
    "postDate": "2024-09-09",
    "contentType": null,
    "headline": "AWS IoT SiteWise Edge adds support for 100+ protocols through Litmus Edge",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#internet-of-things",
            "name": "internet-of-things",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/internet-of-things"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#aws-iot-sitewise",
            "name": "aws-iot-sitewise",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-iot-sitewise"
        }
    ]
}