{
    "id": "whats-new-v2#v1460414620",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-bboEiyUALn78MKMvyGdzbp",
    "dateCreated": "2024-08-26 16:47:48+00:00",
    "dateUpdated": "2024-08-29 21:17:23+00:00",
    "postBody": "Today we’re excited to announce Research and Engineering Studio (RES) on AWS Version 2024.08. This release adds new features such as Amazon S3 bucket mountpoints for Linux, allows creation of custom user roles and permission profiles, and offers the ability to adjust the list of Amazon EC2 instances available to launch as virtual desktops.\nAmazon S3 mountpoints allow Linux desktops to access S3 buckets as a file system. Amazon S3 buckets are created using the AWS Console or AWS CLI and onboarded to RES by administrators using the S3 Buckets page in the web portal. You can mount buckets in either Read Only or Read/Write mode. Read/Write buckets have an optional setting to restrict data access by project, or both project and user. RES can also mount S3 buckets from other AWS accounts with the proper permissions.\nCustom permission profiles allow administrators to create unique permissions and assign them to users or groups. Start by modifying the default Project Member and Project Owner roles or create your own permission set to adjust permissions for project and virtual desktop infrastructure management. The list of allowed instance types is also now configurable from the RES UI. You can adjust this list to define the instances available for virtual desktops in your environment.\nRES 2024.08 extends regional availability to Europe (Stockholm). See the regional availability page for a full list of regions where RES is available.\nCheck out additional release notes on Github to get started and deploy RES 2024.08 today.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/research-engineering-studio-version-2024-08/",
    "postDateTime": "2024-08-29 10:00:00-07:00",
    "postDate": "2024-08-29",
    "contentType": null,
    "headline": "Research and Engineering Studio on AWS Version 2024.08 now available",
    "tags": [
        {
            "id": "whats-new-v2#general-products#aws-govcloud-us",
            "name": "aws-govcloud-us",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-govcloud-us"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#compute",
            "name": "compute",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/compute"
        }
    ]
}