{
    "id": "whats-new-v2#launchmarketingintake1132",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "wHNaPKjy2ZVdZxdwKqTnBc",
    "dateCreated": "2024-07-02 15:26:36+00:00",
    "dateUpdated": "2024-07-09 21:54:12+00:00",
    "postBody": "Today, AWS Glue Studio Visual ETL announces general availability of data preparation authoring, a new no code data preparation user experience for business users and data analysts with a spreadsheet-style UI that runs data integration jobs at scale on AWS Glue for Spark. The new visual data preparation experience makes it easier for data analysts and data scientists to clean and transform data to prepare it for analytics and machine learning (ML). Within this new experience, you can choose from hundreds of prebuilt transformations to automate data preparation tasks, all without the need to write any code.\nBusiness analysts can now collaborate with data engineers to build data integration jobs. Data engineers can use Glue Studio Visual flow-based view to define connections to the data and set the ordering of the data flow process, while business analysts can use the data preparation experience to define the data transformation and output. Additionally, DataBrew customers can import their existing data cleansing and preparation “recipes” to the new AWS Glue data preparation experience and continue to author them directly in AWS Glue Studio and scale up recipes to process petabytes of data, and at the lower price point for AWS Glue jobs.\nThe feature is available in all commercial AWS Regions where AWS Glue DataBrew is available. To learn more, refer to the documentation and read the blog post.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/aws-glue-studio-no-code-data-preparation-authoring-experience",
    "postDateTime": "2024-07-09 17:40:00-04:00",
    "postDate": "2024-07-09",
    "contentType": "Launch Announcement",
    "headline": "AWS Glue Studio now offers a no code data preparation authoring experience",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#analytics",
            "name": "analytics",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/analytics"
        },
        {
            "id": "whats-new-v2#general-products#aws-glue",
            "name": "aws-glue",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/aws-glue"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        }
    ]
}