{
    "id": "whats-new-v2#v1470507030",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "launch-req1TXLRjQcr2qzpAqAGCi",
    "dateCreated": "2024-08-06 16:59:00+00:00",
    "dateUpdated": "2024-08-06 18:31:12+00:00",
    "postBody": "We are excited to announce the launch of Terraform compatibility for Amazon Timestream for InfluxDB. Terraform support enables you to automate and streamline your time-series data management workflows with infrastructure-as-code (IaC).\nWith Terraform support, you can now define and manage your Timestream for InfluxDB instances, databases, and tables using Terraform configuration files, reducing manual errors and increasing efficiency. This feature makes it easier to version and track changes to your infrastructure, providing a more seamless experience for industrial and IoT applications.\nTo get started, use the AWS-provided Terraform Reference Engine on GitHub that conﬁgures the code and infrastructure required for the Terraform open source engine to work with Amazon Timestream for InfluxDB.\nAmazon Timestream for InfluxDB is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), Asia Pacific (Sydney), Asia Pacific (Singapore), Asia Pacific (Mumbai), Europe (Ireland), Europe (Frankfurt), and Europe (Stockholm).\nTo learn more about this new feature and how to get started, visit the Amazon Timestream for InfluxDB product page, documentation, and pricing page. You can also explore the Terraform documentation for more information on how to integrate Terraform with Timestream for InfluxDB.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/08/terraform-amazon-timestream-influxdb-deployments/",
    "postDateTime": "2024-08-06 10:00:00-07:00",
    "postDate": "2024-08-06",
    "contentType": null,
    "headline": "Announcing Terraform support Amazon Timestream for InfluxDB Deployments",
    "tags": [
        {
            "id": "whats-new-v2#general-products#amazon-timestream",
            "name": "amazon-timestream",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-timestream"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        }
    ]
}