{
    "id": "whats-new-v2#p139860878",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "9BUCiqXaJbWvae4STH8y3z",
    "dateCreated": "2024-07-10 19:31:37+00:00",
    "dateUpdated": "2024-07-15 17:32:31+00:00",
    "postBody": "Amazon RDS for MariaDB now supports version 11.4 in the Amazon RDS Database Preview Environment, allowing you to evaluate the latest Long-Term Support Release on Amazon RDS for MariaDB. You can deploy MariaDB 11.4 in the Amazon RDS Database Preview Environment that has the benefits of a fully managed database, making it simpler to set up, operate, and monitor databases.\nMariaDB 11.4 is the latest Long-Term Support Release from the MariaDB community. MariaDB Long-Term Support Releases include bug fixes, security patches, as well as new features. Please refer to the MariaDB 11.4 release notes for more details about this release.\nThe Amazon RDS Database Preview Environment supports both Single-AZ and Multi-AZ deployments on the latest generation of instance classes. Amazon RDS Database Preview Environment database instances are retained for a maximum period of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots that are created in the preview environment can only be used to create or restore database instances within the preview environment.\nAmazon RDS Database Preview Environment database instances are priced the same as production RDS instances created in the US East (Ohio) Region.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/07/amazon-rds-mariadb-long-term-support-version-11-4-preview-environment",
    "postDateTime": "2024-07-15 13:00:00-04:00",
    "postDate": "2024-07-15",
    "contentType": "Launch Announcement",
    "headline": "Amazon RDS for MariaDB supports Long-Term Support version 11.4 in Amazon RDS Database Preview Environment",
    "tags": [
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#marketing-marchitecture#databases",
            "name": "databases",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/databases"
        },
        {
            "id": "whats-new-v2#general-products#amazon-rds",
            "name": "amazon-rds",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-rds"
        }
    ]
}