{
    "id": "whats-new-v2#d156564032",
    "locale": "en_US",
    "directoryId": "whats-new-v2",
    "name": "4ciGMzqH76BTA7SBsYeEHU",
    "dateCreated": "2024-09-05 15:33:56+00:00",
    "dateUpdated": "2024-09-12 18:02:18+00:00",
    "postBody": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R6in and R6idn instances are available in AWS Region Asia Pacific (Sydney). These sixth-generation network optimized instances, powered by 3rd Generation Intel Xeon Scalable processors and built on the AWS Nitro System, deliver up to 200Gbps network bandwidth, 2x more network bandwidth, and up to 2x higher packet-processing performance over comparable fifth-generation instances. Customers can use R6in and R6idn instances to scale the performance and throughput of network-intensive workloads such as memory-intensive SQL and NoSQL databases, distributed web scale in-memory caches (Memcached, Redis), in-memory databases (SAP HANA), and real-time big data analytics (Apache Hadoop, Apache Spark).\nR6in and R6idn instances are available in 10 different instance sizes including metal, with up to 128 vCPUs and 1024 GiB of memory. They deliver up to 100 Gbps of Amazon Elastic Block Store (EBS) bandwidth, and up to 400K IOPS. R6in and R6idn instances offer Elastic Fabric Adapter (EFA) networking support on 32xlarge and metal sizes. R6idn instances offer up to 7.6 TB of high-speed, low-latency instance storage.\nWith this regional expansion, R6in and R6idn instances are available in the following AWS Regions: US East (Ohio), US East (N. Virginia, Oregon), Europe (Ireland, Frankfurt, Stockholm), Asia Pacific (Singapore, Sydney, Tokyo), and AWS GovCloud (US-West). Customers can purchase the new instances through Savings Plans, Reserved, On-Demand, and Spot instances. To learn more, see R6in and R6idn instances page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.\n",
    "headlineUrl": "https://aws.amazon.com/about-aws/whats-new/2024/09/amazon-ec2-r6in-r6idn-instances-additional-region",
    "postDateTime": "2024-09-12 14:00:00-04:00",
    "postDate": "2024-09-12",
    "contentType": "launch announcement",
    "headline": "Amazon EC2 R6in and R6idn instances are now available in an additional region",
    "tags": [
        {
            "id": "whats-new-v2#marketing-marchitecture#compute",
            "name": "compute",
            "tagNamespaceId": "whats-new-v2#marketing-marchitecture",
            "description": "marketing:marchitecture/compute"
        },
        {
            "id": "whats-new-v2#year#2024",
            "name": "2024",
            "tagNamespaceId": "whats-new-v2#year",
            "description": "year#2024"
        },
        {
            "id": "whats-new-v2#general-products#amazon-ec2",
            "name": "amazon-ec2",
            "tagNamespaceId": "whats-new-v2#general-products",
            "description": "general:products/amazon-ec2"
        }
    ]
}